Reports/бит_ЖурналУчетаРегистрацииГражданПоМестуПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ЖурналУчетаРегистрацииГражданПоМестуПроживания</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>мПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РегистрацияПоМестуЖительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияПоМестуПребывания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеСРегистрационногоУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеВСвязиСоСмертью</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПроживания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/бит_ЖурналУчетаРегистрацииГражданПоМестуПроживания/Ext/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура формирует и выводит отчет.
//
// Параметры:
//       ТабДок  - ЭлементФормы.
//
Процедура ЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГражданВывести(ТабДок) Экспорт 
	
	// БИТ_ЖКХ 30.10.2014
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан = Новый ПостроительОтчета; 
	
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.Текст =
	// БИТ_ЖКХ изменения кода. Начало:
	
	// БИТ_ЖКХ 29.07.2010. 
	// Удалены закоментированые участки кода.
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество + "" "" КАК Физлицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаРегистрации,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ДатаСнятияСРегистрации,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Ссылка КАК Документ,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Номер КАК НомерДокуента
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОперацийЗаявлениеОРегистрацииПоМестуПЖ.РегистрацияПоМестуЖительства)
	|	И НЕ бит_ЗаявлениеОРегистрацииПоМестуПЖ.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество + "" "",
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Дата,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо.ДатаРождения,
	|	NULL,
	|	NULL,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка,
	|	бит_СвидетельствоОРегистрацииПоМестуПребывания.Номер
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК ФИОФизЛицСрезПоследних
	|		ПО бит_СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	НЕ бит_СвидетельствоОРегистрацииПоМестуПребывания.ПометкаУдаления";
	// БИТ_ЖКХ изменения кода. Конец
	
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.ЗаполнитьНастройки();
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.ЗаполнениеРасшифровки = ВидЗаполненияРасшифровкиПостроителяОтчета.ЗначенияГруппировок;
	ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан.ТекстЗаголовка = "Журнал учета регистрации граждан по месту проживания";
	
	мПостроительОтчета = ПостроительОтчетаЖурналУчетаВыдачиСвидетельствРегистрацииПоМестуПребыванияРегистрацииГраждан;
	// БИТ_ЖКХ 30.10.2014
	
	ТабДок.Очистить();
	
	мПостроительОтчета.Выполнить();
	мПостроительОтчета.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
	мПостроительОтчета.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	мПостроительОтчета.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
	Выборка =мПостроительОтчета.Результат.Выбрать();
	Макет = ЭтотОбъект.ПолучитьМакет("Форма13");
	ЗаголовокОбласть = Макет.ПолучитьОбласть("Заголовок");
	ДеталиОбласть = Макет.ПолучитьОбласть("Детали");
	ТабДок.Вывести(ЗаголовокОбласть);
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл 
		ДеталиОбласть.Параметры.НомерСтроки = НомерСтроки;
		ДеталиОбласть.Параметры.ФизЛицо = ""+Выборка.Физлицо +", "+ Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
		ДеталиОбласть.Параметры.ДатаПоступления  = Формат(Выборка.Дата,"ДФ=dd.MM.yyyy");
		ДеталиОбласть.Параметры.ДатаРегистрации  = Формат(Выборка.ДатаРегистрации,"ДФ=dd.MM.yyyy")+" -    "+Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd.MM.yyyy");
		ДеталиОбласть.Параметры.ДокументУдостЛич = Строка(Выборка.ДокументСерия)+", "+Строка(Выборка.ДокументНомер)+", "+Строка(Выборка.ДокументКемВыдан)+", "+ Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy");
		ДеталиОбласть.Параметры.АдресМеста       = Строка(Выборка.ЛицевойСчет.Здание.ПочтовыйАдрес)+", кв."+Строка(Выборка.ЛицевойСчет.Квартира)+", Документ: "+Выборка.НомерДокуента+" "+Строка(Выборка.Документ.Метаданные().Синоним);
		// БИТ_ЖКХ изменения кода. Конец
		
		НомерСтроки = НомерСтроки + 1;
		ТабДок.Вывести(ДеталиОбласть);
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти
